trol73/avr-make/asm/include/ATxmega64B1def.inc
;***************************************************************************
;** LCD - LCD Controller
;***************************************************************************/
.equ LCD_CTRLA_offset = 0x00		// Control Register A
.equ LCD_CTRLB_offset = 0x01		// Control Register B
.equ LCD_CTRLC_offset = 0x02		// Control Register C
.equ LCD_INTCTRL_offset = 0x03		// Interrupt Enable Register
.equ LCD_INTFLAG_offset = 0x04		// Interrupt Flag Register
.equ LCD_CTRLD_offset = 0x05		// Control Register D
.equ LCD_CTRLE_offset = 0x06		// Control Register E
.equ LCD_CTRLF_offset = 0x07		// Control Register F
.equ LCD_CTRLG_offset = 0x08		// Control Register G
.equ LCD_CTRLH_offset = 0x09		// Control Register H
.equ LCD_DATA0_offset = 0x10		// LCD Data Register 0
.equ LCD_DATA1_offset = 0x11		// LCD Data Register 1
.equ LCD_DATA2_offset = 0x12		// LCD Data Register 2
.equ LCD_DATA3_offset = 0x13		// LCD Data Register 3
.equ LCD_DATA4_offset = 0x14		// LCD Data Register 4
.equ LCD_DATA5_offset = 0x15		// LCD Data Register 5
.equ LCD_DATA6_offset = 0x16		// LCD Data Register 6
.equ LCD_DATA7_offset = 0x17		// LCD Data Register 7
.equ LCD_DATA8_offset = 0x18		// LCD Data Register 8
.equ LCD_DATA9_offset = 0x19		// LCD Data Register 9
.equ LCD_DATA10_offset = 0x1A		// LCD Data Register 10
.equ LCD_DATA11_offset = 0x1B		// LCD Data Register 11
.equ LCD_DATA12_offset = 0x1C		// LCD Data Register 12
.equ LCD_DATA13_offset = 0x1D		// LCD Data Register 13
.equ LCD_DATA14_offset = 0x1E		// LCD Data Register 14
.equ LCD_DATA15_offset = 0x1F		// LCD Data Register 15
.equ LCD_DATA16_offset = 0x20		// LCD Data Register 16
.equ LCD_DATA17_offset = 0x21		// LCD Data Register 17
.equ LCD_DATA18_offset = 0x22		// LCD Data Register 18
.equ LCD_DATA19_offset = 0x23		// LCD Data Register 19

;***************************************************************************
;** FUSE - Fuses and Lockbits
;***************************************************************************/
.equ NVM_LOCKBITS_LOCKBITS_offset = 0x00		// Lock Bits
.equ NVM_FUSES_FUSEBYTE0_offset = 0x00		// JTAG User ID
.equ NVM_FUSES_FUSEBYTE1_offset = 0x01		// Watchdog Configuration
.equ NVM_FUSES_FUSEBYTE2_offset = 0x02		// Reset Configuration
.equ NVM_FUSES_FUSEBYTE4_offset = 0x04		// Start-up Configuration
.equ NVM_FUSES_FUSEBYTE5_offset = 0x05		// EESAVE and BOD Level

;***************************************************************************
;** SIGROW - Signature Row
;***************************************************************************/
.equ NVM_PROD_SIGNATURES_RCOSC2M_offset = 0x00		// RCOSC 2 MHz Calibration Value B
.equ NVM_PROD_SIGNATURES_RCOSC2MA_offset = 0x01		// RCOSC 2 MHz Calibration Value A
.equ NVM_PROD_SIGNATURES_RCOSC32K_offset = 0x02		// RCOSC 32.768 kHz Calibration Value
.equ NVM_PROD_SIGNATURES_RCOSC32M_offset = 0x03		// RCOSC 32 MHz Calibration Value B
.equ NVM_PROD_SIGNATURES_RCOSC32MA_offset = 0x04		// RCOSC 32 MHz Calibration Value A
.equ NVM_PROD_SIGNATURES_LOTNUM0_offset = 0x08		// Lot Number Byte 0, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM1_offset = 0x09		// Lot Number Byte 1, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM2_offset = 0x0A		// Lot Number Byte 2, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM3_offset = 0x0B		// Lot Number Byte 3, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM4_offset = 0x0C		// Lot Number Byte 4, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM5_offset = 0x0D		// Lot Number Byte 5, ASCII
.equ NVM_PROD_SIGNATURES_WAFNUM_offset = 0x10		// Wafer Number
.equ NVM_PROD_SIGNATURES_COORDX0_offset = 0x12		// Wafer Coordinate X Byte 0
.equ NVM_PROD_SIGNATURES_COORDX1_offset = 0x13		// Wafer Coordinate X Byte 1
.equ NVM_PROD_SIGNATURES_COORDY0_offset = 0x14		// Wafer Coordinate Y Byte 0
.equ NVM_PROD_SIGNATURES_COORDY1_offset = 0x15		// Wafer Coordinate Y Byte 1
.equ NVM_PROD_SIGNATURES_USBCAL0_offset = 0x1A		// USB Calibration Byte 0
.equ NVM_PROD_SIGNATURES_USBCAL1_offset = 0x1B		// USB Calibration Byte 1
.equ NVM_PROD_SIGNATURES_USBRCOSC_offset = 0x1C		// USB RCOSC Calibration Value B
.equ NVM_PROD_SIGNATURES_USBRCOSCA_offset = 0x1D		// USB RCOSC Calibration Value A
.equ NVM_PROD_SIGNATURES_ADCACAL0_offset = 0x20		// ADCA Calibration Byte 0
.equ NVM_PROD_SIGNATURES_ADCACAL1_offset = 0x21		// ADCA Calibration Byte 1
.equ NVM_PROD_SIGNATURES_ADCBCAL0_offset = 0x24		// ADCB Calibration Byte 0
.equ NVM_PROD_SIGNATURES_ADCBCAL1_offset = 0x25		// ADCB Calibration Byte 1
.equ NVM_PROD_SIGNATURES_TEMPSENSE0_offset = 0x2E		// Temperature Sensor Calibration Byte 0
.equ NVM_PROD_SIGNATURES_TEMPSENSE1_offset = 0x2F		// Temperature Sensor Calibration Byte 1


; ***** LOCKBIT REGISTER LOCATIONS ***************************************


;***************************************************************************
;** LOCKBIT - Lockbits
;***************************************************************************
	
.equ LOCKBIT_LOCKBITS = 0		// Lock Bits


; ***** FUSE REGISTER LOCATIONS ******************************************


;***************************************************************************
;** FUSE - Fuses
;***************************************************************************
	
.equ FUSE_FUSEBYTE0 = 0		// JTAG User ID
.equ FUSE_FUSEBYTE1 = 1		// Watchdog Configuration
.equ FUSE_FUSEBYTE2 = 2		// Reset Configuration
.equ FUSE_FUSEBYTE4 = 4		// Start-up Configuration
.equ FUSE_FUSEBYTE5 = 5		// EESAVE and BOD Level


; ***** BIT AND VALUE DEFINITIONS ****************************************


;***************************************************************************
;** GPIO - General Purpose IO
;***************************************************************************/
 

;***************************************************************************
;** VPORT - Virtual Ports
;***************************************************************************/

; VPORT_INTFLAGS masks
.equ VPORT_INT1IF_bm = 0x02 ; Port Interrupt 1 Flag bit mask
.equ VPORT_INT1IF_bp = 1 ; Port Interrupt 1 Flag bit position
.equ VPORT_INT0IF_bm = 0x01 ; Port Interrupt 0 Flag bit mask
.equ VPORT_INT0IF_bp = 0 ; Port Interrupt 0 Flag bit position
 

;***************************************************************************
;** XOCD - On-Chip Debug System
;***************************************************************************/

