trol73/avr-make/asm/include/ATxmega64B1def.inc
; USB_ADDR masks
.equ USB_ADDR_gm = 0x7F ; Device Address group mask
.equ USB_ADDR_gp = 0 ; Device Address group position
.equ USB_ADDR0_bm = (1<<0) ; Device Address bit 0 mask
.equ USB_ADDR0_bp = 0 ; Device Address bit 0 position
.equ USB_ADDR1_bm = (1<<1) ; Device Address bit 1 mask
.equ USB_ADDR1_bp = 1 ; Device Address bit 1 position
.equ USB_ADDR2_bm = (1<<2) ; Device Address bit 2 mask
.equ USB_ADDR2_bp = 2 ; Device Address bit 2 position
.equ USB_ADDR3_bm = (1<<3) ; Device Address bit 3 mask
.equ USB_ADDR3_bp = 3 ; Device Address bit 3 position
.equ USB_ADDR4_bm = (1<<4) ; Device Address bit 4 mask
.equ USB_ADDR4_bp = 4 ; Device Address bit 4 position
.equ USB_ADDR5_bm = (1<<5) ; Device Address bit 5 mask
.equ USB_ADDR5_bp = 5 ; Device Address bit 5 position
.equ USB_ADDR6_bm = (1<<6) ; Device Address bit 6 mask
.equ USB_ADDR6_bp = 6 ; Device Address bit 6 position

; USB_FIFOWP masks
.equ USB_FIFOWP_gm = 0x1F ; FIFO Write Pointer group mask
.equ USB_FIFOWP_gp = 0 ; FIFO Write Pointer group position
.equ USB_FIFOWP0_bm = (1<<0) ; FIFO Write Pointer bit 0 mask
.equ USB_FIFOWP0_bp = 0 ; FIFO Write Pointer bit 0 position
.equ USB_FIFOWP1_bm = (1<<1) ; FIFO Write Pointer bit 1 mask
.equ USB_FIFOWP1_bp = 1 ; FIFO Write Pointer bit 1 position
.equ USB_FIFOWP2_bm = (1<<2) ; FIFO Write Pointer bit 2 mask
.equ USB_FIFOWP2_bp = 2 ; FIFO Write Pointer bit 2 position
.equ USB_FIFOWP3_bm = (1<<3) ; FIFO Write Pointer bit 3 mask
.equ USB_FIFOWP3_bp = 3 ; FIFO Write Pointer bit 3 position
.equ USB_FIFOWP4_bm = (1<<4) ; FIFO Write Pointer bit 4 mask
.equ USB_FIFOWP4_bp = 4 ; FIFO Write Pointer bit 4 position

; USB_FIFORP masks
.equ USB_FIFORP_gm = 0x1F ; FIFO Read Pointer group mask
.equ USB_FIFORP_gp = 0 ; FIFO Read Pointer group position
.equ USB_FIFORP0_bm = (1<<0) ; FIFO Read Pointer bit 0 mask
.equ USB_FIFORP0_bp = 0 ; FIFO Read Pointer bit 0 position
.equ USB_FIFORP1_bm = (1<<1) ; FIFO Read Pointer bit 1 mask
.equ USB_FIFORP1_bp = 1 ; FIFO Read Pointer bit 1 position
.equ USB_FIFORP2_bm = (1<<2) ; FIFO Read Pointer bit 2 mask
.equ USB_FIFORP2_bp = 2 ; FIFO Read Pointer bit 2 position
.equ USB_FIFORP3_bm = (1<<3) ; FIFO Read Pointer bit 3 mask
.equ USB_FIFORP3_bp = 3 ; FIFO Read Pointer bit 3 position
.equ USB_FIFORP4_bm = (1<<4) ; FIFO Read Pointer bit 4 mask
.equ USB_FIFORP4_bp = 4 ; FIFO Read Pointer bit 4 position

; USB_INTCTRLA masks
.equ USB_SOFIE_bm = 0x80 ; Start Of Frame Interrupt Enable bit mask
.equ USB_SOFIE_bp = 7 ; Start Of Frame Interrupt Enable bit position
.equ USB_BUSEVIE_bm = 0x40 ; Bus Event Interrupt Enable bit mask
.equ USB_BUSEVIE_bp = 6 ; Bus Event Interrupt Enable bit position
.equ USB_BUSERRIE_bm = 0x20 ; Bus Error Interrupt Enable bit mask
.equ USB_BUSERRIE_bp = 5 ; Bus Error Interrupt Enable bit position
.equ USB_STALLIE_bm = 0x10 ; STALL Interrupt Enable bit mask
.equ USB_STALLIE_bp = 4 ; STALL Interrupt Enable bit position
.equ USB_INTLVL_gm = 0x03 ; Interrupt Level group mask
.equ USB_INTLVL_gp = 0 ; Interrupt Level group position
.equ USB_INTLVL0_bm = (1<<0) ; Interrupt Level bit 0 mask
.equ USB_INTLVL0_bp = 0 ; Interrupt Level bit 0 position
.equ USB_INTLVL1_bm = (1<<1) ; Interrupt Level bit 1 mask
.equ USB_INTLVL1_bp = 1 ; Interrupt Level bit 1 position

; USB_INTCTRLB masks
.equ USB_TRNIE_bm = 0x02 ; Transaction Complete Interrupt Enable bit mask
.equ USB_TRNIE_bp = 1 ; Transaction Complete Interrupt Enable bit position
.equ USB_SETUPIE_bm = 0x01 ; SETUP Transaction Complete Interrupt Enable bit mask
.equ USB_SETUPIE_bp = 0 ; SETUP Transaction Complete Interrupt Enable bit position

; USB_INTFLAGSACLR masks
.equ USB_SOFIF_bm = 0x80 ; Start Of Frame Interrupt Flag bit mask
.equ USB_SOFIF_bp = 7 ; Start Of Frame Interrupt Flag bit position
.equ USB_SUSPENDIF_bm = 0x40 ; Suspend Interrupt Flag bit mask
.equ USB_SUSPENDIF_bp = 6 ; Suspend Interrupt Flag bit position
.equ USB_RESUMEIF_bm = 0x20 ; Resume Interrupt Flag bit mask
.equ USB_RESUMEIF_bp = 5 ; Resume Interrupt Flag bit position
.equ USB_RSTIF_bm = 0x10 ; Reset Interrupt Flag bit mask
.equ USB_RSTIF_bp = 4 ; Reset Interrupt Flag bit position
.equ USB_CRCIF_bm = 0x08 ; Isochronous CRC Error Interrupt Flag bit mask
.equ USB_CRCIF_bp = 3 ; Isochronous CRC Error Interrupt Flag bit position
.equ USB_UNFIF_bm = 0x04 ; Underflow Interrupt Flag bit mask
.equ USB_UNFIF_bp = 2 ; Underflow Interrupt Flag bit position
.equ USB_OVFIF_bm = 0x02 ; Overflow Interrupt Flag bit mask
.equ USB_OVFIF_bp = 1 ; Overflow Interrupt Flag bit position
.equ USB_STALLIF_bm = 0x01 ; STALL Interrupt Flag bit mask
.equ USB_STALLIF_bp = 0 ; STALL Interrupt Flag bit position

; USB_INTFLAGSASET masks
; Masks for SOFIF aready defined
; Masks for SUSPENDIF aready defined
; Masks for RESUMEIF aready defined
; Masks for RSTIF aready defined
; Masks for CRCIF aready defined
; Masks for UNFIF aready defined
; Masks for OVFIF aready defined
; Masks for STALLIF aready defined

; USB_INTFLAGSBCLR masks
.equ USB_TRNIF_bm = 0x02 ; Transaction Complete Interrupt Flag bit mask
.equ USB_TRNIF_bp = 1 ; Transaction Complete Interrupt Flag bit position
.equ USB_SETUPIF_bm = 0x01 ; SETUP Transaction Complete Interrupt Flag bit mask
.equ USB_SETUPIF_bp = 0 ; SETUP Transaction Complete Interrupt Flag bit position

; USB_INTFLAGSBSET masks
; Masks for TRNIF aready defined
; Masks for SETUPIF aready defined
 
; Interrupt level
.equ USB_INTLVL_OFF_gc = (0x00<<0) ; Interrupt disabled
.equ USB_INTLVL_LO_gc = (0x01<<0) ; Low level
.equ USB_INTLVL_MED_gc = (0x02<<0) ; Medium level
.equ USB_INTLVL_HI_gc = (0x03<<0) ; High level

; USB Endpoint Type
.equ USB_EP_TYPE_DISABLE_gc = (0x00<<6) ; Endpoint Disabled
.equ USB_EP_TYPE_CONTROL_gc = (0x01<<6) ; Control
.equ USB_EP_TYPE_BULK_gc = (0x02<<6) ; Bulk/Interrupt
.equ USB_EP_TYPE_ISOCHRONOUS_gc = (0x03<<6) ; Isochronous

; USB Endpoint Buffersize
.equ USB_EP_BUFSIZE_8_gc = (0x00<<0) ; 8 bytes buffer size
.equ USB_EP_BUFSIZE_16_gc = (0x01<<0) ; 16 bytes buffer size
.equ USB_EP_BUFSIZE_32_gc = (0x02<<0) ; 32 bytes buffer size
.equ USB_EP_BUFSIZE_64_gc = (0x03<<0) ; 64 bytes buffer size
.equ USB_EP_BUFSIZE_128_gc = (0x04<<0) ; 128 bytes buffer size
.equ USB_EP_BUFSIZE_256_gc = (0x05<<0) ; 256 bytes buffer size
.equ USB_EP_BUFSIZE_512_gc = (0x06<<0) ; 512 bytes buffer size
.equ USB_EP_BUFSIZE_1023_gc = (0x07<<0) ; 1023 bytes buffer size


;***************************************************************************
;** PORT - I/O Port Configuration
;***************************************************************************/

