trol73/avr-make/asm/include/ATxmega64B1def.inc
#define PROGMEM_START 0x00000
#define PROGMEM_SIZE 0x11000
#define PROGMEM_END (0x00000 + 0x11000 - 1)

#define APP_SECTION_START 0x00000
#define APP_SECTION_SIZE 0x10000
#define APP_SECTION_END (0x00000 + 0x10000 - 1)

#define APPTABLE_SECTION_START 0x0F000
#define APPTABLE_SECTION_SIZE 0x1000
#define APPTABLE_SECTION_END (0x0F000 + 0x1000 - 1)

#define BOOT_SECTION_START 0x10000
#define BOOT_SECTION_SIZE 0x1000
#define BOOT_SECTION_END (0x10000 + 0x1000 - 1)

#define EEPROM_START 0x00000
#define EEPROM_SIZE 0x0800
#define EEPROM_END (0x00000 + 0x0800 - 1)

#define FUSE_START 0x0000
#define FUSE_SIZE 0x0006
#define FUSE_END (0x0000 + 0x0006 - 1)

#define LOCKBIT_START 0x0000
#define LOCKBIT_SIZE 0x0001
#define LOCKBIT_END (0x0000 + 0x0001 - 1)

#define SIGNATURES_START 0x0000
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x0000 + 0x0003 - 1)

#define USER_SIGNATURES_START 0x0000
#define USER_SIGNATURES_SIZE 0x0200
#define USER_SIGNATURES_END (0x0000 + 0x0200 - 1)

#define PROD_SIGNATURES_START 0x0000
#define PROD_SIGNATURES_SIZE 0x0040
#define PROD_SIGNATURES_END (0x0000 + 0x0040 - 1)

#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x3000
#define DATAMEM_END (0x0000 + 0x3000 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x1000
#define IO_END (0x0000 + 0x1000 - 1)

#define MAPPED_EEPROM_START 0x1000
#define MAPPED_EEPROM_SIZE 0x0800
#define MAPPED_EEPROM_END (0x1000 + 0x0800 - 1)

#define INTERNAL_SRAM_START 0x2000
#define INTERNAL_SRAM_SIZE 0x1000
#define INTERNAL_SRAM_END (0x2000 + 0x1000 - 1)


; Legacy definitions
.equ	FLASHEND    = (PROGMEM_END / 2)  ; Note: Word address
.equ	IOEND       = IO_END
.equ	SRAM_START	= INTERNAL_SRAM_START
.equ	SRAM_SIZE	= INTERNAL_SRAM_SIZE
.equ	RAMEND	    = INTERNAL_SRAM_END
.equ	E2END	    = EEPROM_END
.equ	EEPROMEND	= EEPROM_END


; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x11000
#pragma AVRPART MEMORY EEPROM 0x0800
#pragma AVRPART MEMORY INT_SRAM SIZE 0x1000
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x2000



; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************

; OSC interrupt vectors
.equ OSC_OSCF_vect = 2 ; Oscillator Failure Interrupt (NMI)

; PORTC interrupt vectors
.equ PORTC_INT0_vect = 4 ; External Interrupt 0
.equ PORTC_INT1_vect = 6 ; External Interrupt 1

; PORTR interrupt vectors
.equ PORTR_INT0_vect = 8 ; External Interrupt 0
.equ PORTR_INT1_vect = 10 ; External Interrupt 1

; DMA interrupt vectors
.equ DMA_CH0_vect = 12 ; Channel 0 Interrupt
.equ DMA_CH1_vect = 14 ; Channel 1 Interrupt

; RTC interrupt vectors
.equ RTC_OVF_vect = 20 ; Overflow Interrupt
.equ RTC_COMP_vect = 22 ; Compare Interrupt

; TWIC interrupt vectors
.equ TWIC_TWIS_vect = 24 ; TWI Slave Interrupt
.equ TWIC_TWIM_vect = 26 ; TWI Master Interrupt

; TCC0 interrupt vectors
.equ TCC0_OVF_vect = 28 ; Overflow Interrupt
.equ TCC0_ERR_vect = 30 ; Error Interrupt
.equ TCC0_CCA_vect = 32 ; Compare or Capture A Interrupt
.equ TCC0_CCB_vect = 34 ; Compare or Capture B Interrupt
.equ TCC0_CCC_vect = 36 ; Compare or Capture C Interrupt
.equ TCC0_CCD_vect = 38 ; Compare or Capture D Interrupt

; TCC1 interrupt vectors
.equ TCC1_OVF_vect = 40 ; Overflow Interrupt
.equ TCC1_ERR_vect = 42 ; Error Interrupt
.equ TCC1_CCA_vect = 44 ; Compare or Capture A Interrupt
.equ TCC1_CCB_vect = 46 ; Compare or Capture B Interrupt

; SPIC interrupt vectors
.equ SPIC_INT_vect = 48 ; SPI Interrupt

; USARTC0 interrupt vectors
.equ USARTC0_RXC_vect = 50 ; Reception Complete Interrupt
.equ USARTC0_DRE_vect = 52 ; Data Register Empty Interrupt
.equ USARTC0_TXC_vect = 54 ; Transmission Complete Interrupt

; USB interrupt vectors
.equ USB_BUSEVENT_vect = 62 ; SOF, suspend, resume, reset bus event interrupts, crc, underflow, overflow and stall error interrupts
.equ USB_TRNCOMPL_vect = 64 ; Transaction complete interrupt

; LCD interrupt vectors
.equ LCD_INT_vect = 70 ; LCD Interrupt

; AES interrupt vectors
.equ AES_INT_vect = 72 ; AES Interrupt

; NVM interrupt vectors
.equ NVM_EE_vect = 74 ; EE Interrupt
.equ NVM_SPM_vect = 76 ; SPM Interrupt

; PORTB interrupt vectors
.equ PORTB_INT0_vect = 78 ; External Interrupt 0
.equ PORTB_INT1_vect = 80 ; External Interrupt 1

; ACB interrupt vectors
.equ ACB_AC0_vect = 82 ; AC0 Interrupt
.equ ACB_AC1_vect = 84 ; AC1 Interrupt
.equ ACB_ACW_vect = 86 ; ACW Window Mode Interrupt

; ADCB interrupt vectors
.equ ADCB_CH0_vect = 88 ; Interrupt 0

; PORTD interrupt vectors
.equ PORTD_INT0_vect = 96 ; External Interrupt 0
.equ PORTD_INT1_vect = 98 ; External Interrupt 1

; PORTG interrupt vectors
.equ PORTG_INT0_vect = 100 ; External Interrupt 0
.equ PORTG_INT1_vect = 102 ; External Interrupt 1

; PORTM interrupt vectors
.equ PORTM_INT0_vect = 104 ; External Interrupt 0
.equ PORTM_INT1_vect = 106 ; External Interrupt 1

; PORTE interrupt vectors
.equ PORTE_INT0_vect = 108 ; External Interrupt 0
.equ PORTE_INT1_vect = 110 ; External Interrupt 1

; TCE0 interrupt vectors
.equ TCE0_OVF_vect = 116 ; Overflow Interrupt
.equ TCE0_ERR_vect = 118 ; Error Interrupt
.equ TCE0_CCA_vect = 120 ; Compare or Capture A Interrupt
.equ TCE0_CCB_vect = 122 ; Compare or Capture B Interrupt
.equ TCE0_CCC_vect = 124 ; Compare or Capture C Interrupt
.equ TCE0_CCD_vect = 126 ; Compare or Capture D Interrupt

; USARTE0 interrupt vectors
.equ USARTE0_RXC_vect = 138 ; Reception Complete Interrupt
.equ USARTE0_DRE_vect = 140 ; Data Register Empty Interrupt
.equ USARTE0_TXC_vect = 142 ; Transmission Complete Interrupt

; PORTA interrupt vectors
.equ PORTA_INT0_vect = 150 ; External Interrupt 0
.equ PORTA_INT1_vect = 152 ; External Interrupt 1

; ACA interrupt vectors
.equ ACA_AC0_vect = 154 ; AC0 Interrupt
.equ ACA_AC1_vect = 156 ; AC1 Interrupt
.equ ACA_ACW_vect = 158 ; ACW Window Mode Interrupt

; ADCA interrupt vectors
.equ ADCA_CH0_vect = 160 ; Interrupt 0



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ OSC_vbase = 2
.equ PORTC_vbase = 4
.equ PORTR_vbase = 8
.equ DMA_vbase = 12
.equ RTC_vbase = 20
.equ TWIC_vbase = 24
.equ TCC0_vbase = 28
.equ TCC1_vbase = 40
.equ SPIC_vbase = 48
.equ USARTC0_vbase = 50
.equ USB_vbase = 62
.equ LCD_vbase = 70
.equ AES_vbase = 72
.equ NVM_vbase = 74
.equ PORTB_vbase = 78
.equ ACB_vbase = 82
.equ ADCB_vbase = 88
.equ PORTD_vbase = 96
.equ PORTG_vbase = 100
.equ PORTM_vbase = 104
.equ PORTE_vbase = 108
.equ TCE0_vbase = 116
.equ USARTE0_vbase = 138
.equ PORTA_vbase = 150
.equ ACA_vbase = 154
.equ ADCA_vbase = 160


; ***** INTERRUPT VECTORS, VECTOR OFFSETS *********************************

; OSC interrupt vector offsets

